Библиотека_электронных_документов_демо/src/Documents/_ДемоУдалитьВозвратТоваровОтПокупателя/_ДемоУдалитьВозвратТоваровОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ДемоУдалитьВозвратТоваровОтПокупателя</name>
  <registerRecords>AccumulationRegister._ДемоТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef._ДемоУдалитьВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef._ДемоУдалитьВозвратТоваровОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Enums/ВидыДокументов/ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументов</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураНаАванс</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяНаВозврат</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Enums/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций</name>
  <enumValues>
    <name>Исправление</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Documents/ЭлектронныйДокументВходящий/ЭлектронныйДокументВходящий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронныйДокументВходящий</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВерсияРегламентаЭДО</name>
    <type>
      <types>EnumRef.ВерсииРегламентаОбмена1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭД</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОтправителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостоянияЭДО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентом</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокументаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЭДО</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсииЭД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНастроекЭДО</name>
    <type>
      <types>CatalogRef.ПрофилиНастроекЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЭДО</name>
    <type>
      <types>EnumRef.СостоянияВерсийЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлементаВерсииЭД</name>
    <type>
      <types>EnumRef.ТипыЭлементовВерсииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяИзвещение</name>
    <comment>Требуется извещение от получателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <comment>Требуется подпись получателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаОзнакомлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованияЭлектронныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыОснованийВладельцаФайла</name>
    <comment>Хранит уникальные идентификаторы документов оснований (документы информационной базы на основании которых введен Владелец файла в базе инициатора ЭДО) и признак необходимости связки основания и потомка</comment>
    <attributes>
      <name>ИдентификаторДокументаОснования</name>
      <type>
        <types>DefinedType.ИдентификаторДокументаОснования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЭДДокументаОснования</name>
      <comment>Идентификатор электронного документа, у которого документ-основание указан в реквизите Владелец файла</comment>
      <type>
        <types>DefinedType.ИдентификаторДокументаОснования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Documents/_ДемоУдалитьВозвратТоваровОтПокупателя/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Регистрирует данные для обработчика обновления
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ДокументОснование КАК Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование КАК ДокументОснование
		|	ИЗ
		|		Документ.ЭлектронныйДокументВходящий.ДокументыОснования КАК ЭлектронныйДокументВходящийДокументыОснования
		|	ГДЕ
		|		ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование ССЫЛКА Документ._ДемоУдалитьВозвратТоваровОтПокупателя
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование
		|	ИЗ
		|		Документ.ЭлектронныйДокументИсходящий.ДокументыОснования КАК ЭлектронныйДокументИсходящийДокументыОснования
		|	ГДЕ
		|		ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование ССЫЛКА Документ._ДемоУдалитьВозвратТоваровОтПокупателя
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СостоянияЭД.СсылкаНаОбъект
		|	ИЗ
		|		РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|	ГДЕ
		|		СостоянияЭД.СсылкаНаОбъект ССЫЛКА Документ._ДемоУдалитьВозвратТоваровОтПокупателя) КАК ВложенныйЗапрос";
	
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(
		Параметры.Очередь, "Документ._ДемоУдалитьВозвратТоваровОтПокупателя");
	
	МассивСсылок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование КАК ОбрабатываемыйДокумент,
		|	ЭлектронныйДокументВходящийДокументыОснования.Ссылка КАК ИзменяемыйДокумент,
		|	""ЭлектронныйДокументВходящий"" КАК ВидДанных
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящий.ДокументыОснования КАК ЭлектронныйДокументВходящийДокументыОснования
		|ГДЕ
		|	ЭлектронныйДокументВходящийДокументыОснования.ДокументОснование В (&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование,
		|	ЭлектронныйДокументИсходящийДокументыОснования.Ссылка,
		|	""ЭлектронныйДокументИсходящий""
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящий.ДокументыОснования КАК ЭлектронныйДокументИсходящийДокументыОснования
		|ГДЕ
		|	ЭлектронныйДокументИсходящийДокументыОснования.ДокументОснование В (&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СостоянияЭД.СсылкаНаОбъект,
		|	СостоянияЭД.СсылкаНаОбъект,
		|	""СостоянияЭД""
		|ИЗ
		|	РегистрСведений.СостоянияЭД КАК СостоянияЭД
		|ГДЕ
		|	СостоянияЭД.СсылкаНаОбъект В (&МассивСсылок)
		|ИТОГИ ПО
		|	ОбрабатываемыйДокумент";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		
		Попытка
			
			ВозвратОтПокупателяОбъект = Выборка.ОбрабатываемыйДокумент.ПолучитьОбъект();
			ПоступлениеОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ПоступлениеОбъект, ВозвратОтПокупателяОбъект);
			Для Каждого СтрокаТаблицы Из ВозвратОтПокупателяОбъект.Товары Цикл
				НоваяСтрока = ПоступлениеОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла;
			
			ПоступлениеОбъект.ВидДокумента = Перечисления.ВидыДокументов.НакладнаяНаВозврат;
			ПоступлениеОбъект.ВидОперации  = Перечисления.ВидыОпераций.Реализация;
			
			ПоступлениеОбъект.ДополнительныеСвойства.Вставить("ПроверитьЗаполнениеБезВыводаОшибок");
			Если ВозвратОтПокупателяОбъект.Проведен
				И ПоступлениеОбъект.ПроверитьЗаполнение() Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				ПоступлениеОбъект.ОбменДанными.Загрузка = Истина;
				РежимЗаписи = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			ПоступлениеОбъект.Записать(РежимЗаписи);
			
			ВыборкаИзменяемыеДанные = Выборка.Выбрать();
			Пока ВыборкаИзменяемыеДанные.Следующий() Цикл
				
				Если ВыборкаИзменяемыеДанные.ВидДанных = "ЭлектронныйДокументВходящий"
					ИЛИ ВыборкаИзменяемыеДанные.ВидДанных = "ЭлектронныйДокументИсходящий" Тогда
					
					ЭлектронныйДокумент = ВыборкаИзменяемыеДанные.ИзменяемыйДокумент.ПолучитьОбъект();
					ПараметрыОтбора = Новый Структура("ДокументОснование", Выборка.ОбрабатываемыйДокумент);
					МассивСтрок = ЭлектронныйДокумент.ДокументыОснования.НайтиСтроки(ПараметрыОтбора);
					Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
						СтрокаТаблицы.ДокументОснование = ПоступлениеОбъект.Ссылка;
					КонецЦикла;
					
					ЭлектронныйДокумент.ОбменДанными.Загрузка = Истина;
					ЭлектронныйДокумент.Записать();
					
				ИначеЕсли ВыборкаИзменяемыеДанные.ВидДанных = "СостоянияЭД" Тогда
					
					Запись = РегистрыСведений.СостоянияЭД.СоздатьМенеджерЗаписи();
					Запись.СсылкаНаОбъект = Выборка.ОбрабатываемыйДокумент;
					Запись.Прочитать();
					Если Запись.Выбран() Тогда
						Запись.СсылкаНаОбъект = ПоступлениеОбъект.Ссылка;
						Запись.Записать(Истина);
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.ОбрабатываемыйДокумент);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать документ: %1 по причине: %2'"), 
				Выборка.ОбрабатываемыйДокумент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			СобытиеЖурналаРегистрации = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы._ДемоУдалитьВозвратТоваровОтПокупателя, Выборка.ОбрабатываемыйДокумент, ТекстСообщения);
			
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь,
		"Документ._ДемоУдалитьВозвратТоваровОтПокупателя");
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы.
Функция ДанныеОбновленыНаНовуюВерсиюПрограммы(МетаданныеИОтбор) Экспорт
	
	Если МетаданныеИОтбор.ПолноеИмя = "Документ._ДемоУдалитьВозвратТоваровОтПокупателя" Тогда
		Возврат ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы(МетаданныеИОтбор);
	Иначе
		Возврат ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено,
			"Документ._ДемоУдалитьВозвратТоваровОтПокупателя");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
